package Lesson_2;

public class TaskSeven {
    public static void main(String[] args) {
        // Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.

        for (int i = 10; i <= 20; i++) {
            System.out.print((i * i) + " ");
        }
    }
}
